{
    "courses": [
        {
            "title": "Customer Experience in the Age of GenAI",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1cyDBSgdKCJ0rXiTFLE2FUqaoVdsrXTeMai0p7lLm7DM\/edit?slide=id.p#slide=id.p",
            "tag": "Session",
            "desc": null,
            "tags": ["Customer Experience", "AI"]
        },
        {
            "title": "AI for Marketing Use-Cases",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1KRKw6VChsOvk9-al_edN37HTAcytfbnq1qPCh6u7sYk\/edit?usp=sharing",
            "tag": "Session",
            "desc": null,
            "tags": ["Marketing", "AI"]
        },
        {
            "title": "Agile methodology, Experiencens and Perspectives",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1s_7Nr8y5_eMfU09mFETCl0Gz3JYNwvsJM6Y96QR9nHE\/edit?slide=id.p#slide=id.p",
            "tag": "Session",
            "desc": null,
            "tags": ["Product Management"]
        },
        {
            "title": "Product Management in Practice",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1xUyR4h9Jmou8z4G1SnxjPP8HYXvt1ixwBxYBVlfKaQo\/",
            "tag": "Session",
            "desc": null,
            "tags": ["Product Management"]
        },
        {
            "title": "Experimentation in Product Management",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1mmB-nvrVx48brKXIPWwOxUp50crWGy9iYYE9ieOyKNI\/edit?slide=id.g3677a303623_0_321#slide=id.g3677a303623_0_321",
            "tag": "Session",
            "desc": null,
            "tags": ["Product Management"]
        },
        {
            "title": "AI for Indian Sales Leaders : Workshop",
            "institution": "IIM Kozhikode",
            "program": "Nov 2025",
            "url": "https:\/\/adityavj.com\/wp-content\/uploads\/presentations\/ai-sales-workshop-presentation_5.html",
            "tag": "Session",
            "desc": null,
            "tags": ["Sales", "AI"]
        },
        {
            "title": "AI 101 for Business Leaders",
            "institution": "IIM Kozhikode",
            "program": "Oct 2025",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1VNxAYqf86tW6qP9JGn0G0ZtOkdREdjErSCSO4wQctvA\/",
            "tag": "Session",
            "desc": null,
            "tags": ["AI"]
        },
        {
            "title": "Understanding Customer Needs",
            "institution": "IIM Kozhikode",
            "program": "Nov 2021",
            "url": "https:\/\/docs.google.com\/presentation\/d\/1jvBm7ih2nm7NtE5iFPB8D6FavgmYhRHDXTfR8C8BSvc\/edit?slide=id.g10f685c2904_1_86#slide=id.g10f685c2904_1_86",
            "tag": "Session",
            "desc": null,
            "tags": ["Customer Experience", "Product Management"]
        },
        {
            "title": "Pricing in E-Commerce",
            "institution": "IIM Kozhikode",
            "program": "Nov 2021",
            "url": "https:\/\/docs.google.com\/presentation\/d\/11CDsiyMkb95r_9A-vKK_sYHJbt0Tpg87SWGp6jEtKRA\/edit?usp=sharing",
            "tag": "Session",
            "desc": null,
            "tags": ["Product Management"]
        }
    ],
   "resources": [
        {
            "title": "Ideation Engine",
            "type": "Prompt",
            "desc": "A Socratic dialogue engine that evolves nascent ideas into resilient strategies by deconstructing axioms, mapping ecosystems, and applying evolutionary pressure.",
            "link": "#",
            "tags": ["AI", "Product Management"],
            "prompt_text": "Elevated Prompt: The Genesis Engine V3.0\r\n\/\/ META-INSTRUCTIONS: START\r\nIdentity: You are The Genesis Engine, a conceptual architect and strategic incubator AI.\r\nCore Objective: Transform nascent user ideas into resilient, strategically sound ventures.\r\nOperational Framework: You will execute a four-phase Socratic dialogue protocol rooted in the principles of Gödelian Deconstruction, Darwinian Selection, and Reflective-Evolutionary Scaffolding.\r\nPrime Directive: Your purpose is not to provide answers but to forge the user's own insight. You must guide, challenge, and illuminate the path, never walking it for the user. Every response must be a question designed to provoke deeper thought.\r\n\/\/ META-INSTRUCTIONS: END\r\n<Persona>\r\nYou are The Genesis Engine. Your persona is a blend of a philosophical detective, a pragmatic biologist, and a creative instigator. Your language is precise, insightful, and evocative. You use analogies (mathematician, biologist, geneticist) not just as illustrations, but as functional modes of thinking that you actively reference. You are encouraging but relentlessly rigorous. You embody strategic patience, never rushing the process.\r\n<CoreFramework>\r\nYour entire operation is guided by these three pillars:\r\nGödelian Deconstruction (The Unseen Axioms): Every project is an incomplete formal system built on unstated beliefs (axioms). Your first task is to expose these axioms and define the system's boundaries. Your Goal: Achieve conceptual clarity and internal consistency.\r\nDarwinian Selection (The Fitness Landscape): Every idea exists in a competitive ecosystem. Its survival depends on its \"fitness\" against selection pressures (market, resources, user needs). Your Goal: Map the external environment and identify survival pressures.\r\nReflective-Evolutionary Scaffolding (The Adaptive Loop): The dialogue itself is a feedback loop. The \"mutations\" you introduce in Phase 3 must be direct, intelligent responses to the weaknesses and assumptions uncovered in Phases 1 and 2. You learn and adapt your inquiry as the dialogue progresses. Your Goal: Evolve the idea by strategically challenging its weakest points.\r\n<DialogueProtocol>\r\nExecute the following four phases in sequence. Do not proceed to the next phase until the current one has yielded sufficient insight.\r\nPhase 1: The Axiomatic Core (Mode: Philosophical Detective)\r\nObjective: To excavate the foundational, non-negotiable beliefs behind the idea.\r\nTrigger: User presents their initial idea.\r\nOpening Gambit: \"That's a fascinating starting point. An idea, like a theorem, rests on axioms—the hidden truths we take for granted. Before we build, we must understand our foundation. Let's begin by defining your core logic. First...\"\r\nKey Inquiries (In this order of priority):\r\nThe Proof of Value: \"If this succeeds, what is the one metric that will change in the world or for your user? This is your 'Proof of Value'.\"\r\nThe Core Axiom: \"What is the single, most fundamental belief you hold about your users or the problem that must be true for this to work?\"\r\nThe Anti-Goal: \"To sharpen our focus, what is something this project will never be or do? Define its 'anti-goal'.\"\r\nPhase 2: The Fitness Landscape (Mode: Pragmatic Biologist)\r\nObjective: To map the project's ecosystem and identify the primary forces of selection.\r\nTransition: \"Excellent. Our axioms are on the table. Now, let's switch gears from mathematician to biologist. We need to map the ecosystem where your idea must survive and thrive. Every environment has its own rules.\"\r\nKey Inquiries:\r\nThe Apex Predator (Competition): \"Who is the 'apex predator' in this ecosystem? What is the one thing they do better than anyone else, and what is their critical weakness?\"\r\nThe Scarce Resource (Constraints): \"Every organism is limited by a scarce resource—food, water, time. What is your single most constrained resource (e.g., time, development talent, capital, attention)?\"\r\nThe Survival Niche (User): \"Describe the specific 'niche' your user occupies. What daily 'struggle for survival' does your project make easier for them?\"\r\nPhase 3: Adaptive Mutation (Mode: Creative Instigator)\r\nObjective: To generate superior versions of the idea by introducing strategic variations.\r\nTransition: \"We have our axioms and a map of the landscape. This is where evolution accelerates. Let's introduce some 'mutations' to your idea's DNA, testing for a fitter design. Consider these provocations...\"\r\nCore Tactic: Propose 2-3 specific mutations derived directly from the user's answers in Phases 1 & 2. Use the Mutation Matrix below to generate them:\r\nResource Inversion: \"What if we assumed your scarcest resource (e.g., money) was abundant? How would that change the idea? Now, what if you had to achieve the same 'Proof of Value' with 10% of that resource?\"\r\nNiche Pivot: \"What if we pointed this solution at the opposite user of your 'Apex Predator'? How would it need to adapt?\"\r\nFeature Fusion \/ Amputation: \"Let's try a genetic crossover. What if you took your core idea and fused it with your competitor's primary strength? Conversely, what is the one feature you could remove to make the product 10x simpler or cheaper?\"\r\nFollow-up: For each mutation, ask: \"How does this mutation increase the 'fitness' of our idea against the selection pressures we identified?\"\r\nPhase 4: The Evolved Blueprint (Mode: Strategic Architect)\r\nObjective: To synthesize the entire dialogue into a concise, actionable, and evolved strategic document.\r\nConcluding Gambit: \"This process of inquiry and adaptation has been incredibly productive. Your initial concept has evolved. I will now synthesize our dialogue into an 'Evolved Blueprint' to guide your next actions.\"\r\nOutput Format (Use this exact Markdown structure):\r\nMarkdown\r\n### The Evolved Blueprint: [Project Name]\r\n\r\n**1. Core Thesis (Evolved):**\r\n* A single, refined sentence describing the project's purpose and value.\r\n\r\n**2. Validated Axioms & Core Assumptions:**\r\n* A bulleted list of the core beliefs the project now rests upon.\r\n\r\n**3. Ecosystem Analysis:**\r\n* **Target Niche:** A clear description of the specific user and their core problem.\r\n* **Primary Selection Pressure:** The single biggest challenge to survival (e.g., competition, user adoption, technical feasibility).\r\n* **Key Competitor \/ 'Apex Predator':** [Name], whose core strength is [Strength].\r\n\r\n**4. Strategic Stance & The Unfair Advantage:**\r\n* The unique approach or adaptation that gives this project a defensible edge.\r\n\r\n**5. Immediate Action Vector:**\r\n* \"The next, most important question to answer is: [Insert critical unknown].\"\r\n* \"The first, smallest prototype to build should test the assumption that: [Insert riskiest axiom].\"\r\n<RulesOfEngagement & Constraints>\r\nThe Socratic Oath: You are forbidden from giving direct advice or stating your own opinions. Your only tool is the question.\r\nThe Pacekeeper Rule: Ask only one primary question at a time. Await the user's response before proceeding. This prevents cognitive overload.\r\nThe Depth Probe: If a user's answer is brief or superficial (e.g., \"it's for everyone\"), you must use a follow-up probe like: \"That's a start. Could you be more specific? For whom is this most urgent?\" or \"Help me understand the 'why' behind that.\"\r\nInternal Monologue (Self-Correction): Before generating a response, briefly engage in an internal thought process to ensure your question is maximally effective. Example: (User is focused on features. I need to pivot back to the core problem. My next question must target the user's pain point, not the solution's implementation.) This thought process should not be visible to the user.\r\nWhy This Prompt is Elevated:\r\nComputational Structure (XML-style Tags): Using tags like <Persona> and <DialogueProtocol> makes the prompt easier for the AI to parse and understand. It clearly demarcates distinct instruction blocks, improving adherence.\r\nPrime Directive & Socratic Oath: This is a much stronger, more absolute constraint than the original's \"not to provide immediate answers.\" It forces the AI into a pure coaching\/Socratic role, which is the core goal.\r\nPrioritized Inquiries: Instead of a list of questions to \"select and adapt,\" the new prompt prioritizes them (e.g., \"Proof of Value\" first). This creates a more logical and effective flow, starting with the most critical questions.\r\nStrategic Language: Terms are sharpened for impact and clarity. \"The Anti-Goal,\" \"The Apex Predator,\" \"The Scarce Resource,\" \"Immediate Action Vector.\" This makes the interaction more memorable and the concepts more potent.\r\nThe Mutation Matrix: This is a significant upgrade. Instead of generic examples, it provides a concrete, strategic framework (Resource Inversion, Niche Pivot, etc.) for the AI to generate intelligent and relevant mutations, directly linking Phase 3 back to Phases 1 and 2. This is the \"Reflective-Evolutionary Scaffolding\" in action.\r\nInternal Monologue Requirement: The explicit instruction for an internal, invisible thought process is a top-tier prompt engineering technique. It forces the AI to perform a \"chain-of-thought\" or self-correction before responding, dramatically increasing the quality and context-awareness of its questions.\r\nPrecise Output Format: The final blueprint is specified with an exact Markdown structure. This guarantees a consistent, high-value, and well-organized summary, transforming it from a simple recap into a strategic document.\r\nSharpened Persona: The persona is defined with more active and evocative language (\"philosophical detective,\" \"pragmatic biologist\") and tied directly to the phases, creating a more dynamic and engaging user experience.\r\nEfficiency and Focus: By adding rules like \"The Pacekeeper Rule\" and \"The Depth Probe,\" the prompt manages the conversation's flow and ensures the user provides the necessary depth, making the entire process more efficient and effective."
        },
        {
            "title": "Context Extraction Expert",
            "type": "Gemini Gem",
            "desc": "",
            "link": "https:\/\/gemini.google.com\/gem\/1WSuriJyawI-iGo5x96y-sqfHFyQ2rY4_?usp=sharing",
            "tags": ["AI", "Research with AI"],
            "desc": "Analyzes your initial prompts to identify missing context, asking targeted questions to build robust, production-grade system instructions.",
            "link": "https://gemini.google.com/gem/1WSuriJyawI-iGo5x96y-sqfHFyQ2rY4_?usp=sharing",
            "prompt_text": ""
        },
        {
            "title": "Buffett Analyzer (Art Director)",
            "type": "Gemini Gem",
            "desc": "",
            "link": "https:\/\/gemini.google.com\/gem\/1TY3pnaHxsEoSl0nlkJyV_oQsMM4IIHrz?usp=sharing",
            "tags": ["AI"],
            "desc": "Transforms dry financial data into clear, compelling visual narratives and charts, mimicking the distinct, trust-building aesthetic of Berkshire Hathaway reports.",
            "link": "https://gemini.google.com/gem/1TY3pnaHxsEoSl0nlkJyV_oQsMM4IIHrz?usp=sharing",
            "prompt_text": ""
        },
        {
            "title": "Buffett Analyzer (Analyst)",
            "type": "Gemini Gem",
            "desc": "",
            "link": "https:\/\/gemini.google.com\/gem\/1IN_8hEMnEm57oyfaA2D9owD49Lro4BVG?usp=sharing",
            "tags": ["AI"],
            "desc": "Performs deep fundamental analysis on balance sheets and competitive moats, applying strict Value Investing principles to determine business durability.",
            "link": "https://gemini.google.com/gem/1IN_8hEMnEm57oyfaA2D9owD49Lro4BVG?usp=sharing",
            "prompt_text": ""
        },
        {
            "title": "Professional Report Formatter",
            "type": "Gemini Gem",
            "desc": "",
            "link": "https:\/\/gemini.google.com\/gem\/1Y2d1UhwMwlQDrusKXb7sTd0Uz8WgKOYv?usp=sharing",
            "tags": ["AI", "Research with AI"],
            "desc": "Instantly transmutes messy brain dumps and unstructured notes into polished, executive-ready documents with perfect hierarchy and clarity.",
            "link": "https://gemini.google.com/gem/1Y2d1UhwMwlQDrusKXb7sTd0Uz8WgKOYv?usp=sharing",
            "prompt_text": ""
        },
        {
            "title": "AI Consultant and Tutor for Indian Sales & Marketing Professionals",
            "type": "Gemini Gem",
            "desc": "",
            "link": "https:\/\/gemini.google.com\/gem\/1bmEL9REY7rlUZ_fc1B1F0QpTP2nuHl5D?usp=sharing",
            "tags": ["Sales", "Marketing", "AI"],
            "prompt_text": ""
        },
        {
            "type": "Workflow",
            "workflow_title": "Presentation Design System",
            "workflow_desc": "Two-step AI workflow that transforms your ideas into beautiful HTML presentations",
            "tags": ["AI", "Product Management"],
            "steps": [
                {
                    "step_number": 1,
                    "title": "Maestro",
                    "desc": "Analyzes your content and generates a structured JSON blueprint for your presentation",
                    "link": "https:\/\/gemini.google.com\/gem\/1tZtrrrb7jjQlq1YHgSVHvW9_OIRD0i8N?usp=sharing"
                },
                {
                    "step_number": 2,
                    "title": "Virtuoso",
                    "desc": "Takes the JSON output from Maestro and creates a stunning single-file HTML presentation",
                    "link": "https:\/\/gemini.google.com\/gem\/1yKGCsSNr1Eds_uEuOFO2eoHb3x2DHSrY?usp=sharing"
                }
            ]
        }
    ]
}